"use client"

import dynamic from "next/dynamic"
import { useMemo } from "react";

import "react-quill/dist/quill.snow.css";

interface EditorProps {
    onChange: (value: string) => void;
    value: string;
}

export const Editor: React.FC<EditorProps> = ({
    onChange,
    value
}) => {

//     استفاده از `ssr: false` در اینجا به این معناست که می‌خواهید کتابخانه "react-quill" فقط در محیط مشتری (Client-side) بارگیری شود و در قسمت سرور (Server-side) نباشد. این انتخاب ممکن است به دلایل زیر باشد:

// 1. **حجم بارگیری کاهش یابد:** اگر کتابخانه‌ها یا ماژول‌هایی در صفحه وجود داشته باشند که تنها در محیط مشتری نیاز به استفاده دارند و در SSR استفاده نمی‌شوند، استفاده از `ssr: false` می‌تواند حجم بارگیری را کاهش دهد. این می‌تواند به بهبود زمان بارگیری صفحه کمک کند.

// 2. **مسائل امنیتی:** برخی از کتابخانه‌ها یا ماژول‌ها ممکن است نیاز به دسترسی به محیط مشتری داشته باشند و از اطلاعات محیط سرور مخفی باشند. اجرای کد در محیط سرور ممکن است به دلایل امنیتی مشکلاتی ایجاد کند. با استفاده از `ssr: false`، مطمئن می‌شوید که کد مربوط به این کتابخانه تنها در محیط مشتری اجرا می‌شود.

// 3. **مسائل عملکردی:** برخی از کتابخانه‌ها بهترین عملکرد خود را در محیط مشتری دارند و اجرای آنها در سمت سرور تاثیر مخربی بر عملکرد کل سیستم می‌گذارد. با استفاده از `ssr: false` می‌توانید این مشکلات عملکردی را کاهش دهید.

// در کل، استفاده از `ssr: false` برای کتابخانه‌ها و ماژول‌هایی که تنها در محیط مشتری نیاز به استفاده دارند، به بهبود عملکرد و امنیت برنامه کمک می‌کند.
    
    const ReactQuill = useMemo(() => dynamic(() => import("react-quill"), { ssr: false }), []);

    return (
        <div className="bg-white">
            <ReactQuill
                theme="snow"
                value={value}
                onChange={onChange}
            />
        </div>
    )
};